In [1]:
%load_ext sql
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

In [2]:
%%sql
postgresql://root:dRxOcyPFRkbiX2Cxv0IVbTZyP66rWeu4@dpg-d1mfu2e3jp1c73epncfg-a.singapore-postgres.render.com/duolingo_up3k

# Duolingo Database Demo

## Account Login
### Get Password

In [4]:
%%sql
SELECT get_password('alice');

 * postgresql://root:***@dpg-d1mfu2e3jp1c73epncfg-a.singapore-postgres.render.com/duolingo_up3k
1 rows affected.

[('hash1',)]

In [5]:
%%sql
SELECT '--- Demoing create_user_and_fill_energy ---' AS Demo;
SELECT create_user_and_fill_energy(
    'Test',
    'User',
    'testuser123',
    'test@example.com',
    'new_secure_hash',
    'English'
) AS new_user_id;

 * postgresql://root:***@dpg-d1mfu2e3jp1c73epncfg-a.singapore-postgres.render.com/duolingo_up3k
1 rows affected.
1 rows affected.
(psycopg2.errors.UndefinedFunction) function get_user_profile(unknown) does not exist
LINE 1: SELECT * FROM get_user_profile('testuser123') AS new_user_pr...
                      ^
HINT:  No function matches the given name and argument types. You might need to add explicit type casts.

[SQL: SELECT * FROM get_user_profile('testuser123') AS new_user_profile;]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [6]:
%%sql
SELECT * FROM get_user_profile('testuser123') AS new_user_profile;
SELECT * FROM get_current_energy((SELECT user_id FROM users WHERE username = 'testuser123')) AS new_user_energy;

 * postgresql://root:***@dpg-d1mfu2e3jp1c73epncfg-a.singapore-postgres.render.com/duolingo_up3k
1 rows affected.
1 rows affected.

[('testuser123', 5, datetime.datetime(2025, 7, 11, 6, 17, 28, 384416))]

In [7]:
%%sql
SELECT * FROM get_user_profile('bob') AS bob_profile;

 * postgresql://root:***@dpg-d1mfu2e3jp1c73epncfg-a.singapore-postgres.render.com/duolingo_up3k
1 rows affected.

[(2, 'Bob', 'Johnson', 'bob', 'bob@example.com', 'French', 120, 2, datetime.datetime(2025, 7, 11, 5, 52, 13, 969472))]

## Update User Profile

In [8]:
%%sql
SELECT update_user_profile(
    'felix',
    'FelixUpdated',       -- New first name
    'Greenwood',          -- New last name
    'felix.green@example.com', -- New email
    'updated_hash_felix', -- New password hash
    'German'              -- New preferred language
);

SELECT * FROM get_user_profile('felix') AS updated_felix_profile;

 * postgresql://root:***@dpg-d1mfu2e3jp1c73epncfg-a.singapore-postgres.render.com/duolingo_up3k
1 rows affected.
1 rows affected.
1 rows affected.

[(6, 'FelixUpdated', 'Greenwood', 'felix', 'felix.green@example.com', 'German', 75, 1, datetime.datetime(2025, 7, 11, 5, 52, 13, 969472))]

## Give + Get Achievements
Records that a specific user has earned a particular achievement.

In [9]:
%%sql
SELECT award_achievement('danny', 'First Lesson');
SELECT * FROM get_user_achievements('danny') AS danny_achievements;

 * postgresql://root:***@dpg-d1mfu2e3jp1c73epncfg-a.singapore-postgres.render.com/duolingo_up3k
1 rows affected.
2 rows affected.

[('danny', 'First Lesson', 'Completed your first lesson!', datetime.datetime(2025, 7, 11, 6, 28, 23, 597703)),
 ('danny', 'Shopper', 'Made your first shop purchase.', datetime.datetime(2025, 7, 11, 5, 52, 13, 969472))]

## Leaderboard

In [11]:
%%sql
SELECT * FROM get_leaderboard() AS top_learners_leaderboard;

 * postgresql://root:***@dpg-d1mfu2e3jp1c73epncfg-a.singapore-postgres.render.com/duolingo_up3k
10 rows affected.

[('george', 610),
 ('carla', 500),
 ('jack', 420),
 ('irene', 320),
 ('alice', 300),
 ('danny', 250),
 ('hannah', 200),
 ('bob', 120),
 ('felix', 75),
 ('emma', 0)]

## Get User XP

In [12]:
%%sql
SELECT get_user_xp('george') AS george_xp;

 * postgresql://root:***@dpg-d1mfu2e3jp1c73epncfg-a.singapore-postgres.render.com/duolingo_up3k
1 rows affected.

[(610,)]

## Increase Streak

In [13]:
%%sql
SELECT increase_streak('hannah');
SELECT xp, streak FROM get_user_profile('hannah') AS hannah_updated_stats;

 * postgresql://root:***@dpg-d1mfu2e3jp1c73epncfg-a.singapore-postgres.render.com/duolingo_up3k
1 rows affected.
1 rows affected.

[(210, 5)]

## Get Completed Lessons

In [14]:
%%sql
SELECT * FROM get_user_completed_lessons('alice') AS alice_completed_lessons;

 * postgresql://root:***@dpg-d1mfu2e3jp1c73epncfg-a.singapore-postgres.render.com/duolingo_up3k
2 rows affected.

[('alice', 'Spanish Basics', 'Greetings', 20, datetime.datetime(2025, 7, 10, 0, 0)),
 ('alice', 'Spanish Basics', 'Food', 30, datetime.datetime(2025, 7, 10, 0, 0))]

## Get User Completed Courses

In [15]:
%%sql
SELECT * FROM get_user_completed_courses('alice', 'Spanish Basics') AS alice_spanish_progress;

 * postgresql://root:***@dpg-d1mfu2e3jp1c73epncfg-a.singapore-postgres.render.com/duolingo_up3k
1 rows affected.

[('alice', 'Spanish Basics', 3, 2)]

## Enroll User To Course

In [16]:
%%sql
SELECT enroll_user_in_course_by_id(
    (SELECT user_id FROM users WHERE username = 'jack'),
    (SELECT course_id FROM courses WHERE title = 'German Basics'),
    'enrolled'
) AS jack_enrollment_id_by_id;
SELECT u.username, c.title AS course_title, uc.enrollment_status
FROM user_courses uc
JOIN users u ON uc.user_id = u.user_id
JOIN courses c ON uc.course_id = c.course_id
WHERE u.username = 'jack' AND c.title = 'German Basics';

 * postgresql://root:***@dpg-d1mfu2e3jp1c73epncfg-a.singapore-postgres.render.com/duolingo_up3k
1 rows affected.
1 rows affected.

[('jack', 'German Basics', 'enrolled')]

## Add Course

In [17]:
%%sql
SELECT add_course(
    'English',
    'Advanced English Conversation',
    'Practice fluency and advanced vocabulary in English.'
) AS new_course_id;
SELECT * FROM get_course_list() WHERE title = 'Advanced English Conversation';

 * postgresql://root:***@dpg-d1mfu2e3jp1c73epncfg-a.singapore-postgres.render.com/duolingo_up3k
1 rows affected.
1 rows affected.

[(6, 'Advanced English Conversation', 'Practice fluency and advanced vocabulary in English.', 'English')]

## Get Course List

In [18]:
%%sql
SELECT * FROM get_course_list() AS all_courses;

 * postgresql://root:***@dpg-d1mfu2e3jp1c73epncfg-a.singapore-postgres.render.com/duolingo_up3k
6 rows affected.

[(1, 'Spanish Basics', 'Learn greetings, food, and travel in Spanish.', 'Spanish'),
 (2, 'French Basics', 'Essential phrases and grammar in French.', 'French'),
 (3, 'German Basics', 'Kickstart your German journey.', 'German'),
 (4, 'Japanese Hiragana', 'Master Hiragana characters and simple words.', 'Japanese'),
 (5, 'Thai for Beginners', 'Start speaking Thai with core vocabulary.', 'Thai'),
 (6, 'Advanced English Conversation', 'Practice fluency and advanced vocabulary in English.', 'English')]

## Drop User From Course

In [19]:
%%sql
SELECT drop_user_course(
    (SELECT user_id FROM users WHERE username = 'emma'),
    (SELECT course_id FROM courses WHERE title = 'Japanese Hiragana')
);
SELECT u.username, c.title, uc.enrollment_status
FROM user_courses uc
JOIN users u ON uc.user_id = u.user_id
JOIN courses c ON uc.course_id = c.course_id
WHERE u.username = 'emma' AND c.title = 'Japanese Hiragana';

 * postgresql://root:***@dpg-d1mfu2e3jp1c73epncfg-a.singapore-postgres.render.com/duolingo_up3k
1 rows affected.
1 rows affected.

[('emma', 'Japanese Hiragana', 'dropped')]

## Add Lesson By Course ID

In [20]:
%%sql
SELECT add_lesson_to_course_by_id(
    (SELECT course_id FROM courses WHERE title = 'Spanish Basics'),
    'Numbers and Counting',
    4 -- Next logical order in course
) AS new_lesson_id_by_id;

SELECT * FROM get_lessons_list((SELECT course_id FROM courses WHERE title = 'Spanish Basics'));

 * postgresql://root:***@dpg-d1mfu2e3jp1c73epncfg-a.singapore-postgres.render.com/duolingo_up3k
1 rows affected.
4 rows affected.

[(1, 'Greetings', 1, 'Spanish Basics'),
 (2, 'Food', 2, 'Spanish Basics'),
 (3, 'Travel', 3, 'Spanish Basics'),
 (11, 'Numbers and Counting', 4, 'Spanish Basics')]

## Add Lessons to List

In [21]:
%%sql
SELECT * FROM get_lessons_list((SELECT course_id FROM courses WHERE title = 'German Basics')) AS german_basics_lessons;

 * postgresql://root:***@dpg-d1mfu2e3jp1c73epncfg-a.singapore-postgres.render.com/duolingo_up3k
1 rows affected.

[(6, 'Intro A', 1, 'German Basics')]

## Add Exercise to Lesson

In [22]:
%%sql
SELECT add_exercise(
    (SELECT lesson_id FROM lessons WHERE name = 'Numbers and Counting' AND course_id = (SELECT course_id FROM courses WHERE title = 'Spanish Basics')),
    'What is "one" in Spanish?',
    'Uno',
    'translation',
    1 -- Order in lesson
) AS new_exercise_id;

SELECT * FROM get_exercises((SELECT lesson_id FROM lessons WHERE name = 'Numbers and Counting' AND course_id = (SELECT course_id FROM courses WHERE title = 'Spanish Basics')));

 * postgresql://root:***@dpg-d1mfu2e3jp1c73epncfg-a.singapore-postgres.render.com/duolingo_up3k
1 rows affected.
1 rows affected.

[(13, 'What is "one" in Spanish?', 'Uno', 'translation', 'Numbers and Counting', 1)]

## Get Exercises

In [23]:
%%sql
SELECT '--- Demoing get_exercises ---' AS Demo;
SELECT * FROM get_exercises((SELECT lesson_id FROM lessons WHERE name = 'Greetings' AND course_id = (SELECT course_id FROM courses WHERE title = 'Spanish Basics'))) AS greetings_exercises;

 * postgresql://root:***@dpg-d1mfu2e3jp1c73epncfg-a.singapore-postgres.render.com/duolingo_up3k
1 rows affected.
2 rows affected.

[(1, 'Translate "Hello"', 'Hola', 'translation', 'Greetings', 1),
 (2, 'Translate "Goodbye"', 'Adiós', 'translation', 'Greetings', 2)]

## Deduct Energy

In [24]:
%%sql
SELECT deduct_energy((SELECT user_id FROM users WHERE username = 'alice')); -- Alice's energy is currently 3 (from seed data)
SELECT energy_remaining FROM get_current_energy((SELECT user_id FROM users WHERE username = 'alice')) AS alice_energy_after_deduct;

 * postgresql://root:***@dpg-d1mfu2e3jp1c73epncfg-a.singapore-postgres.render.com/duolingo_up3k
1 rows affected.
1 rows affected.

[(2,)]

## Get Current Energy

In [25]:
%%sql
SELECT * FROM get_current_energy((SELECT user_id FROM users WHERE username = 'carla')) AS carla_energy;

 * postgresql://root:***@dpg-d1mfu2e3jp1c73epncfg-a.singapore-postgres.render.com/duolingo_up3k
1 rows affected.

[('carla', 0, datetime.datetime(2025, 7, 11, 0, 52, 13, 969472))]

## Add Shop Item

In [26]:
%%sql

SELECT add_shop_item('Practice Hub Access', 300, 'Unlock unlimited practice exercises.') AS new_shop_item_id;
SELECT * FROM shop_items WHERE name = 'Practice Hub Access';

 * postgresql://root:***@dpg-d1mfu2e3jp1c73epncfg-a.singapore-postgres.render.com/duolingo_up3k
1 rows affected.
1 rows affected.

[(6, 'Practice Hub Access', 300, 'Unlock unlimited practice exercises.')]

## User's Items

In [27]:
%%sql
SELECT * FROM get_user_purchase_items((SELECT user_id FROM users WHERE username = 'george')) AS george_purchases;

 * postgresql://root:***@dpg-d1mfu2e3jp1c73epncfg-a.singapore-postgres.render.com/duolingo_up3k
1 rows affected.

[('george', 'Streak Freeze', 100, datetime.datetime(2025, 7, 11, 5, 52, 13, 969472))]